//Написать программу, которая на вход принемает число от пользователя и возводит его в квадрат(умноженное само на себя)

Console.WriteLine("Введите число");
int a = Convert.ToInt32 ( Console.ReadLine());

int a2 = a *a;

Console.Write(a2);
